                             M A C A N O V A   4.07

       An Interactive Program for Statistical Analysis and Matrix Algebra
            For information on major features, type 'help(macanova)'
          For information on linear models and GLM's, type 'help(glm)'
              For latest information on changes, type 'help(news)'
               For information on Unix version, type 'help(unix)'
                        Version of 03/25/99 (HP/UX [gcc])
             Type 'help(copyright)' for copyright and warranty info
        Copyright (C) 1994 - 1999 Gary W. Oehlert and Christopher Bingham

       MacAnova will automatically attempt to read undefined macros from a
           file.  See macros, addmacrofile, getmacros, and macroread()

Cmd> # File to test commands in Chapter 4 of MacAnova Users' Guide

Cmd> # Version of 990324

Cmd> # Set default configuration

Cmd> startTime <- gettime(quiet:T,keep:T)

Cmd> setoptions(default:T)

Cmd> DEGPERRAD <- 180/PI; E <- exp(1)

Cmd> PLATFORM <- vecread(string:VERSION,char:T)[5]

Cmd> MACINTOSH <- PLATFORM == "(Mac" || PLATFORM == "(Macintosh" ||\
	PLATFORM == "(Power"

Cmd> DOS <- PLATFORM == "(DOS" || PLATFORM == "(Win32s"

Cmd> if (MACINTOSH || DOS){DATAPATH <- DATAPATHS <- HOME;;}

Cmd> PATHSEP <- if (MACINTOSH){":"}else{"/"}

Cmd> DATAFILE <- "macanova.dat"; MACROFILE <-  "macanova.mac"

Cmd> MACROFILES <- vector(MACROFILE,"tser.mac","design.mac","arima.mac")

Cmd> setoptions(errors:20,dumbplot:T,height:25,width:80)

Cmd> #5. Time Series related functions

Cmd> #5.1 Introduction

Cmd> #5.2 Operations useful in frequency domain time series analysis

Cmd> #5.2.1 The DFT (Discrete Fourier Transform)

Cmd> #5.2.2 Continuous Fourier transform of a finite series			

Cmd> #5.2.3  Representation of Real, Hermitian and Complex Series

Cmd> hx <- matrix(run(10),2)'

Cmd> hy <- matrix(run(12),2)'

Cmd> print(hx,hy) # two matrices, each containing 2 Hermitian series
hx:
(1,1)            1            2
(2,1)            3            4
(3,1)            5            6
(4,1)            7            8
(5,1)            9           10
hy:
(1,1)            1            2
(2,1)            3            4
(3,1)            5            6
(4,1)            7            8
(5,1)            9           10
(6,1)           11           12

Cmd> cx <- matrix(run(20),4)'

Cmd> print(cx) # Complex matrix containing 2 complex series
cx:
(1,1)            1            2            3            4
(2,1)            5            6            7            8
(3,1)            9           10           11           12
(4,1)           13           14           15           16
(5,1)           17           18           19           20

Cmd> #5.2.4  Functions for manipulating Complex and Hermitian series

Cmd> hxj <- hconj(hx);cxj <- cconj(cx);print(hxj,cxj)
hxj:
(1,1)            1            2
(2,1)            3            4
(3,1)            5            6
(4,1)           -7           -8
(5,1)           -9          -10
cxj:
(1,1)            1           -2            3           -4
(2,1)            5           -6            7           -8
(3,1)            9          -10           11          -12
(4,1)           13          -14           15          -16
(5,1)           17          -18           19          -20

Cmd> print(REhx:hreal(hx),IMhx:himag(hx)) # Note the symmetries
REhx:
(1,1)            1            2
(2,1)            3            4
(3,1)            5            6
(4,1)            5            6
(5,1)            3            4
IMhx:
(1,1)            0            0
(2,1)            9           10
(3,1)            7            8
(4,1)           -7           -8
(5,1)           -9          -10

Cmd> print(REcx:creal(cx),IMcx:cimag(cx))
REcx:
(1,1)            1            3
(2,1)            5            7
(3,1)            9           11
(4,1)           13           15
(5,1)           17           19
IMcx:
(1,1)            2            4
(2,1)            6            8
(3,1)           10           12
(4,1)           14           16
(5,1)           18           20

Cmd> htoc(hx)
(1,1)            1            0            2            0
(2,1)            3            9            4           10
(3,1)            5            7            6            8
(4,1)            5           -7            6           -8
(5,1)            3           -9            4          -10

Cmd> ctoh(cx)
(1,1)            1            3
(2,1)           11           13
(3,1)           11           13
(4,1)           -2           -2
(5,1)           -6           -6

Cmd> cmplx(creal(cx),cimag(cx)) # same as cx
(1,1)            1            2            3            4
(2,1)            5            6            7            8
(3,1)            9           10           11           12
(4,1)           13           14           15           16
(5,1)           17           18           19           20

Cmd> cmplx(creal(cx)) # missing 2nd arg assumed 0
(1,1)            1            0            3            0
(2,1)            5            0            7            0
(3,1)            9            0           11            0
(4,1)           13            0           15            0
(5,1)           17            0           19            0

Cmd> print(hpolar:hpolar(hx),cpolar:cpolar(cx))
hpolar:
(1,1)            1            2
(2,1)       9.4868        10.77
(3,1)       8.6023           10
(4,1)      0.95055       0.9273
(5,1)        1.249       1.1903
cpolar:
(1,1)       2.2361       1.1071            5       0.9273
(2,1)       7.8102      0.87606        10.63      0.85197
(3,1)       13.454      0.83798       16.279      0.82885
(4,1)       19.105      0.82242       21.932      0.81765
(5,1)       24.759      0.81396       27.586      0.81103

Cmd> # Use hypot() and atan() to confirm result of cpolar

Cmd> hypot(cx[,vector(1,3)],cx[,vector(2,4)]) # = creal(polar(cx))
(1,1)       2.2361            5
(2,1)       7.8102        10.63
(3,1)       13.454       16.279
(4,1)       19.105       21.932
(5,1)       24.759       27.586

Cmd> atan(cx[,vector(2,4)],cx[,vector(1,3)]) # = cimag(polar(cx))
(1,1)       1.1071       0.9273
(2,1)      0.87606      0.85197
(3,1)      0.83798      0.82885
(4,1)      0.82242      0.81765
(5,1)      0.81396      0.81103

Cmd> print(hrect:hrect(hpolar(hx)),crect:crect(cpolar(cx)))
hrect:
(1,1)            1            2
(2,1)            3            4
(3,1)            5            6
(4,1)            7            8
(5,1)            9           10
crect:
(1,1)            1            2            3            4
(2,1)            5            6            7            8
(3,1)            9           10           11           12
(4,1)           13           14           15           16
(5,1)           17           18           19           20

Cmd> setoptions(angles:"cycles") # angles assumed in cycles

Cmd> cpolar(cx)
(1,1)       2.2361      0.17621            5      0.14758
(2,1)       7.8102      0.13943        10.63      0.13559
(3,1)       13.454      0.13337       16.279      0.13192
(4,1)       19.105      0.13089       21.932      0.13013
(5,1)       24.759      0.12955       27.586      0.12908

Cmd> phi <- .2*run(2,6);phi# smoothly changing phi in cycles
(1)          0.4          0.6          0.8            1          1.2

Cmd> z <- cmplx(run(5)*cos(phi),run(5)*sin(phi)) # Complex series

Cmd> cpolar(z) # col 1 is modulus, column 2 is unwound phase
(1,1)            1          0.4
(2,1)            2          0.6
(3,1)            3          0.8
(4,1)            4            1
(5,1)            5          1.2

Cmd> cpolar(z,unwind:F) # suppress unwinding and you get a jump
(1,1)            1          0.4
(2,1)            2         -0.4
(3,1)            3         -0.2
(4,1)            4  -3.8982e-17
(5,1)            5          0.2

Cmd> @tmp <- atan(sin(phi),cos(phi)); hconcat(@tmp,unwind(@tmp))
(1,1)          0.4          0.4
(2,1)         -0.4          0.6
(3,1)         -0.2          0.8
(4,1)  -3.8982e-17            1
(5,1)          0.2          1.2

Cmd> #5.2.5 padto() and rotate()

Cmd> padto(run(5),9)
(1)            1            2            3            4            5
(6)            0            0            0            0

Cmd> b <- vector(3,2,1,1,2); rotate(b, 2)
(1)            1            2            3            2            1

Cmd> rotate(b, -2)
(1)            1            1            2            3            2

Cmd> rotate(b, 17)
(1)            1            2            3            2            1

Cmd> #5.2.6  Elementwise products of Complex and Hermitian series

Cmd> hprdhj(hx) #same as hprdhj(hx,hx); note 0 imaginary parts
(1,1)            1            4
(2,1)           90          116
(3,1)           74          100
(4,1)            0            0
(5,1)            0            0

Cmd> cprdcj(cx) # or cprdcj(cx,cx); note 0 imaginary parts
(1,1)            5            0           25            0
(2,1)           61            0          113            0
(3,1)          181            0          265            0
(4,1)          365            0          481            0
(5,1)          613            0          761            0

Cmd> #5.2.7  Discrete Fourier Transforms - rft(), hft() and cft()

Cmd> rx <- run(5)^2; hx <- rft(rx)

Cmd> hx # Hermitian form of the DFT of {1, 4, 9, 16, 25}
(1)           55      -10.264      -14.736       5.6861       24.087

Cmd> cx <- cmplx(rx) ; cft(cx) # Complex form of the same
(1,1)           55            0
(2,1)      -10.264       24.087
(3,1)      -14.736       5.6861
(4,1)      -14.736      -5.6861
(5,1)      -10.264      -24.087

Cmd> hconj(rft(hft(hx),divbyt:T)) # inversion applied to hft(hx)
(1)           55      -10.264      -14.736       5.6861       24.087

Cmd> hft(hconj(rft(rx)),divbyt:T) # inversion applied to rft(hx)
(1)            1            4            9           16           25

Cmd> cconj(cft(cconj(cft(cx)),divbyt:T))#inversion applied to cft(cx)
(1,1)            1            0
(2,1)            4            0
(3,1)            9            0
(4,1)           16            0
(5,1)           25            0

Cmd> rft(run(31)) # can't do this one
ERROR: largest prime factor > 29 in length of rft

Cmd> getmacros(factors,quiet:T) # retrieve it from MacAnova.mac

Cmd> factors(2*365+run(5)) # get factors of 731, 732, 733, 734, 735
component: composite
(1)           17           43
component: composite
(1)            2            2            3           61
component: prime
(1)          733
component: composite
(1)            2          367
component: composite
(1)            3            5            7            7

Cmd> #5.2.8 Convolving series using the DFT and function convolve()

Cmd> x <- vector(1,3,2,4,5); a <- vector(1,-3,2); convolve(a,x)
(1)           -6           10           -5            4           -3

Cmd> vector(1*1+(-3)*5+2*4, 1*3+(-3)*1+2*5, 1*2+(-3)*3+2*1,\
1*4+(-3)*2+2*3, 1*5+(-3)*4+2*2) # explicit expressions
(1)           -6           10           -5            4           -3

Cmd> aft <- rft(padto(a,5)); xft <- rft(x)#compute DFT's of length 5

Cmd> hft(hconj(hprdh(aft,xft)),divbyt:T) #inv. transform of product
(1)           -6           10           -5            4           -3

Cmd> convolve(a,padto(x,7))
(1)            1            0           -5            4           -3
(6)           -7           10

Cmd> vector(1*1, 1*3+(-3)*1, 1*2+(-3)*3+2*1, 1*4+(-3)*2+2*3,\
1*5+(-3)*4+2*2, (-3)*5+2*4,  2*5) # explicit expressions
(1)            1            0           -5            4           -3
(6)           -7           10

Cmd> convolve(a,x,reverse:T)
(1)           -4            8           -9            0            5

Cmd> vector(1*1+(-3)*3+2*2, 1*5+(-3)*1+2*3, 1*4+(-3)*5+2*1,\
1*2+(-3)*4+2*5, 1*3+(-3)*2+2*4) # explicit expressions
(1)           -4            8           -9            0            5

Cmd> hft(hconj(hprdhj(aft,xft)),divbyt:T)
(1)           -4            8           -9   7.1054e-16            5

Cmd> convolve(a,padto(x,7),reverse:T)
(1)           -4            3            2            5          -11
(6)            0            5

Cmd> vector(1*1+(-3)*3+2*2, (-3)*1+2*3, 2*1, 1*5, 1*4+(-3)*5,\
1*2+(-3)*4+2*5, 1*3+(-3)*2+2*4) # explicit expressions
(1)           -4            3            2            5          -11
(6)            0            5

Cmd> hft(hconj(hprdhj(rft(padto(a,7)),rft(padto(x,7)))),divbyt:T)
(1)           -4            3            2            5          -11
(6)  -1.0151e-15            5

Cmd> #5.3  Functions related to time domain time series analysis

Cmd> #5.3.1 Moving average and autoregressive operators

Cmd> #5.3.2  movavg()

Cmd> setseeds(287236458,760033449) # set seeds (See Sec. 2.12)

Cmd> theta <- vector(.5, .3); n <- 5; a <- rnorm(n); a
(1)        1.212      0.63568      -1.8396      -0.5317      0.41061

Cmd> movavg(theta,a)
(1)        1.212     0.029677      -2.5211       0.1974       1.2283

Cmd> a-theta[1]*vector(0,a[-n])-theta[2]*vector(0,0,a[-run(n-1,n)])
(1)        1.212     0.029677      -2.5211       0.1974       1.2283

Cmd> d1 <- movavg(1,a); d1 # first differences a[i]-a[i-1] of a
(1)        1.212     -0.57633      -2.4753       1.3079      0.94231

Cmd> d2 <- movavg(vector(2,-1),a); d2 # second differences of a
(1)        1.212      -1.7883       -1.899       3.7832      -0.3656

Cmd> movavg(theta,a,reverse:T)
(1)       1.4461        1.715      -1.6969     -0.73701      0.41061

Cmd> a - theta[1]*vector(a[-1],0) - theta[2]*vector(a[-run(2)],0,0)
(1)       1.4461        1.715      -1.6969     -0.73701      0.41061

Cmd> movavg(theta,a,limits:vector(2,4),start:run(5))
(1)            1     0.029677      -2.5211       0.1974            5

Cmd> movavg(theta,a,limits:vector(2,4),start:run(5),reverse:T)
(1)            1        1.715      -1.6969     -0.73701            5

Cmd> #5.3.3 autoreg()

Cmd> phi <- vector(1.43,-.57) ; x <- autoreg(phi,a); x
(1)        1.212       2.3689        0.857     -0.65643      -1.0166

Cmd> a + phi[1] * vector(0,x[-5]) + phi[2]*vector(0,0,x[-run(4,5)])
(1)        1.212       2.3689        0.857     -0.65643      -1.0166

Cmd> autoreg(1,a) # cumulative sums a[1], a[1]+a[2], ...
(1)        1.212       1.8477    0.0080789     -0.52362     -0.11301

Cmd> b <- run(5);x1 <-  autoreg(phi,a,limits:vector(2,4),start:b);x1
(1)            1       2.0657      0.54431     -0.93077            5

Cmd> a[3]+phi[1]*x1[2]+phi[2]*x1[1] # x1[1] is the same as b[1]
(1)      0.54431

Cmd> x1r <- autoreg(phi,a,limits:vector(2,4),start:b,reverse:T);x1r
(1)            1       3.6909       4.7746       6.6183            5

Cmd> a[3]+phi[1]*x1r[4]+phi[2]*x1r[5] # x1r[5] is the same as b[5]
(1)       4.7746

Cmd> autoreg(vector(1,1),padto(1,10)) # compute 10 Fibonacci numbers
(1)            1            1            2            3            5
(6)            8           13           21           34           55

Cmd> #5.3.4 yulewalker() and partacf()

Cmd> rho <- vector(0.2,-0.248,0.31232)

Cmd> phi <-yulewalker(rho); phi
(1)         0.41        -0.43          0.5

Cmd> yulewalker(phi,inverse:T) # recover rho from phi.
(1)          0.2       -0.248      0.31232

Cmd> yulewalker(vector(.1,-.7,.29,.4))
WARNING: Col. 1 of argument not positive definite at row 3
         Remaining elements in column assumed zero
(1)      0.88889     -0.88889            1            0

Cmd> movavg(phi,vector(rho[run(3,1)],1,rho))[run(5,7)]
(1)            0   2.7756e-17            0

Cmd> #5.3.5 toeplitz()

Cmd> toeplitz(vector(1,.6,-.17,-.52,-.2))
(1,1)            1          0.6        -0.17        -0.52         -0.2
(2,1)          0.6            1          0.6        -0.17        -0.52
(3,1)        -0.17          0.6            1          0.6        -0.17
(4,1)        -0.52        -0.17          0.6            1          0.6
(5,1)         -0.2        -0.52        -0.17          0.6            1

Cmd> #5.3.6 Finding zeros of polynomials - polyroot()

Cmd> phi <- vector(1.42, -.73)

Cmd> z <- polyroot(phi); z # zeros of z^2 - 1.42z + .73
(1,1)         0.71      0.47529
(2,1)         0.71     -0.47529

Cmd> cprdc(z) - phi[1]*z - cmplx(phi[2]) # they are zeros
(1,1)            0            0
(2,1)            0            0

Cmd> creal(cpolar(z)) # modulus of zeros of z^2-phi[1]*z-phi[2]
(1)       0.8544       0.8544

Cmd> #5.4 Macros useful in time series analysis

Cmd> phi <- vector(1.42, -.73)# coefs of oscillatory AR(2) series

Cmd> theta <- .7 # coef of MA(1) series

Cmd> setseeds(2013847346, 1009143553)# set seeds (Sec. 2.13.1)

Cmd> x <- 12 + 2*autoreg(phi,rnorm(250))[-run(50)] # Sec. 5.3.3

Cmd> y <- 50 + 4*movavg(theta,rnorm(201))[-1] # Sec. 5.3.2

Cmd> z <- .5*x + y

Cmd> S <- 400

Cmd> delete(y) # no longer needed

Cmd> sxx <- hreal(2^2*hprdhj(rft(autoreg(phi,padto(1,S)))))

Cmd> syy <- hreal(4^2*hprdhj(rft(movavg(theta,padto(1,S)))))

Cmd> szz <- .5^2*sxx + syy # o.k. because x and y independent

Cmd> coher <- 1/sqrt(1+4*syy/sxx)

Cmd> delete(syy, szz) # no longer needed; save memory

Cmd> #5.4.1 Plotting against time

Cmd> getmacros(tsplot,quiet:T)

Cmd> tsplot(hconcat(x,z),1981,1/12,xlab:"Year",title:\
"Artificial time series, delta t = 1 month; solid=x, dashed=z")
              Artificial time series, delta t = 1 month; solid=x, dashed=z
           +---+-------+-------+-------+-------+-------+------+-------+-------+
         70+                              -                                   +
           |     - ---  -             -  --  -              -          -   -  |
           |     ------ -- ---  -     -  -- --   --  - -    -- -   - - -   -- |
         60+- - ------- -- ---- - --------- --- ---- - ---- ----- -- ---  ----+
           |----------------------- ------- --------------------------- - --- |
 T         |- --- ------ ----------   --- --- -- ------- ---- - --- ---  -- - |
 i       50+- -    -  -- - -- -- -     -  - -     -  --   -     --  --   -  - +
 m         |       -  -    -           -          -  --          -       -    |
 e       40+       -                   -                                      +
           |                                                                  |
 s         |                                                                  |
 e       30+                                                                  +
 r         |                                                                  |
 i         |     .      .                .   .                                |
 e       20+    ..      ..         .     .. . .             .          .  .. .+
 s         | .. . .  .  ..   .  .  . ..  .. . .   ..    .   .. .   .  . . .. .|
           | .. . . .... .   .. . . ... . . . . . .. . ..... ....  .... . ... |
         10+... . ..  .. .... .. ..   ... . . ..... .. . .    . . . ..  . ... +
           |.  .  ..   .  ..  .. .     .. . . ..     ..         ..      . . . |
           |   .               .           ..  .      .                 ..    |
          0+---+-------+-------+-------+-------+-------+------+-------+-------+
             1982    1984    1986    1988    1990    1992   1994    1996
                                          Year

Cmd> #5.4.2 Plotting against frequency - ffplot ffplot(y)

Cmd> DELTAT <- 1/12 # observations every month = 1/12 year

Cmd> getmacros(ffplot,quiet:T)

Cmd> ffplot(sxx,xlab:"Cycles per year",ylab:"Spectrum",\
title:"Spectrum of AR(2) series, phi = (1.42,-.73), sigma = 2")
                 Spectrum of AR(2) series, phi = (1.42,-.73), sigma = 2
           ++---------+----------+----------+----------+----------+----------++
        180+:          .                                                      +
           |:          ..                                                     |
        160+:         . .                                                     +
           |:         .  .                                                    |
        140+:         .  .                                                    +
           |:        .   .                                                    |
           |:        .    .                                                   |
 S      120+:        .    .                                                   +
 p         |:       .     .                                                   |
 e      100+:       .     .                                                   +
 c         |:      .       .                                                  |
 t       80+:      .       .                                                  +
 r         |:     .        .                                                  |
 u       60+:    .          .                                                 +
 m         |:  ..           .                                                 |
         40+...             ..                                                +
           |:                .                                                |
         20+:                 ..                                              +
           |:                  ....                                           |
           |:                     ............................................|
          0++---------+----------+----------+----------+----------+----------++
            0         1          2          3          4          5          6
                                     Cycles per year

Cmd> ffplot(hreal(sxx),vector(-1,1)/DELTAT,xlab:"Cycles per year",\
ylab:"Frequency",title:"Two full periods of Spectrum")
                              Two full periods of Spectrum
           +-----+------------+-------------+-------------+------------+------+
        180+  .                          .  :  .                          .   +
           |  ..                         .  :  .                         ..   |
        160+  ..                         .  :  .                         ..   +
           |  ..                         .  :  .                         ..   |
        140+  ..                         .. :  .                         ..   +
           |  ..                         .. : ..                         ..   |
 F         |  ..                         .. : . .                        ..   |
 r      120+  ..                         .. : . .                        ..   +
 e         |  ..                        . . : . .                        ..   |
 q      100+  ..                        . . : . .                        ...  +
 u         | . .                        . . : . .                        . .  |
 e       80+ . .                        . . : . .                        . .  +
 n         | . .                        . . : . .                        . .  |
 c       60+ . .                        .  .:.. .                        . .  +
 y         |..  .                       .  .:.  .                       .. .. |
         40+.   .                       .  ...  .                       .   ..+
           |    .                       .   :   ..                      .     |
         20+    .                      .    :    .                      .     +
           |    ..                     .    :    ..                    ..     |
           |     ......................     :     ......................      |
          0+-----+------------+-------------+-------------+------------+------+
                -10          -5             0             5           10
                                     Cycles per year

Cmd> ffplot(coher,ymin:0,xlab:"Frequency (cycles per year)",\
ylab:"Coherence",title:"Coherence between series x and z")
                            Coherence between series x and z
           ++---------+----------+----------+----------+----------+----------++
          1+:          .                                                      +
           |...............                                                   |
           |:             ..                                                  |
           |:              ..                                                 |
        0.8+:               .                                                 +
           |:               ..                                                |
 C         |:                .                                                |
 o         |:                 .                                               |
 h      0.6+:                  .                                              +
 e         |:                  ..                                             |
 r         |:                   ..                                            |
 e         |:                    ..                                           |
 n      0.4+:                     ..                                          +
 c         |:                      ..                                         |
 e         |:                       ...                                       |
           |:                         ...                                     |
        0.2+:                           ....                                  +
           |:                               ......                            |
           |:                                    ....................         |
          0+:.................................................................+
           ++---------+----------+----------+----------+----------+----------++
            0         1          2          3          4          5          6
                               Frequency (cycles per year)

Cmd> #5.4.3 Computing auto-covariances - autocov

Cmd> getmacros(autocov,quiet:T)

Cmd> acf <- autocov(x,60) # autocovariances up to 60 lags

Cmd> tsplot(acf,0,impulse:T,ymin:-max(acf),xlab:"Lag in Years",\
title:"Autocovariance function for AR(2)",ylab:"Auto Covariance")
                            Autocovariance function for AR(2)
           ++------------+------------+------------+------------+------------++
           |.                                                                 |
           |..                                                                |
           |..                                                                |
 A       20+..                                                                +
 u         |...                                                               |
 t         |...                                                               |
 o       10+...                                                               +
           |...                                                               |
 C         |....      ....                                                    |
 o         |....     ... ..        ....      ......          .....            |
 v        0+..................................................................+
 a         |:  ......       ......      ....            ...         ...       |
 r         |:   .....         ...         .                                   |
 i         |:   ....                                                          |
 a      -10+:   ....                                                          +
 n         |:    ..                                                           |
 c         |:                                                                 |
 e      -20+:                                                                 +
           |:                                                                 |
           |:                                                                 |
           ++------------+------------+------------+------------+------------++
            0            1            2            3            4            5
                                      Lag in Years

Cmd> delete(acf) # no longer needed; save memory

Cmd> #5.4.4 Removing a polynomial trend - detrend

Cmd> getmacros(detrend,quiet:T)

Cmd> x1 <- vector(7,9,8,2,3,6,14,2,4,9) # short time series

Cmd> detrend(x1) # remove linear trend, default degree 1
(1)      0.38182       2.4303       1.4788      -4.4727      -3.4242
(6)     -0.37576       7.6727      -4.2788      -2.2303       2.8182

Cmd> detrend(x1,0) # subtract mean, degree 0 polynomial
(1)          0.6          2.6          1.6         -4.4         -3.4
(6)         -0.4          7.6         -4.4         -2.4          2.6

Cmd> detrend(x1,2) # remove quadratic trend; 2nd degree polynomial
(1)     -0.89091       2.0061       1.6909      -3.8364      -2.5758
(6)      0.47273       8.3091      -4.0667      -2.6545       1.5455

Cmd> #5.4.5 Using tapers (data windows) - costaper and compza

Cmd> TT <- 200; m <- .05*TT

Cmd> a <- vector(.5*(1-cos(.5*(run(0,m-1)+.5)/m)),rep(1,TT-2*m),\
     .5*(1-cos(.5*(TT-run(TT-m,TT-1)-.5)/m)))

Cmd> delete(a);#no longer needed

Cmd> getmacros(costaper,quiet:T)

Cmd> tsplot(costaper(200,.2),0,1,xlab:"Time",ylab:"Taper",\
title:"20% cosine taper")
                                    20% cosine taper
           ++---------------+---------------+---------------+----------------++
          1+:            .......................................              +
           |:          ..                                       ..            |
           |:         .                                           .           |
           |:        ..                                           ..          |
        0.8+:        .                                             .          +
           |:       .                                               .         |
           |:       .                                               .         |
           |:      .                                                 .        |
 T      0.6+:      .                                                 .        +
 a         |:     .                                                   .       |
 p         |:     .                                                   .       |
 e         |:    .                                                     .      |
 r      0.4+:    .                                                     .      +
           |:   ..                                                     ..     |
           |:   .                                                       .     |
           |:  ..                                                       ..    |
        0.2+:  .                                                         .    +
           |: .                                                           .   |
           |:..                                                           ..  |
           |..                                                             ...|
          0++---------------+---------------+---------------+----------------++
            0              50              100             150             200
                                          Time

Cmd> tsplot(costaper(200,.2)*detrend(x,0),1981,xlab:"Time (year)",\
title:"20% cosine tapered version of AR(2) series")
                       20% cosine tapered version of AR(2) series
           +---+-------+-------+-------+-------+-------+------+-------+-------+
           |            .                                                     |
           |            .                    .                                |
           |            .                .   .                                |
         10+            ..               .  ..                                +
           |            ..               .. ..              .                 |
 T         |            ..         .     .. ..              .                 |
 i         |            ..   .     .  .  .. . .             ..                |
 m        5+         .  ..   .     . ..  .. . .    .    .   ..                +
 e         |     .   .  ..   .  .  ....  .. . .   ..    ..  .. .       .      |
           |    . . .. . .   .. . . . . . . . . . ..    .... . .   .  . .     |
 s         |    . . . .. .   .. . . . . . . . . . ..   .....  ...  .... . ..  |
 e        0+..................................................................+
 r         |   .  ..  .. .. . .. ..   . . . . . ... .. .        . . ..  ..    |
 i         |      ..  .. .... .. ..    .. . . .. .   . .        . . .   ..    |
 e         |          ..  ... .. ..    .. . . ..     ..         ...           |
 s       -5+           .  ..  .. .     .. . . ..     ..         ..            +
           |           .      ..       .  . . ..      .                       |
           |                   .           .. ..      .                       |
        -10+                   .           .          .                       +
           |                               .                                  |
           +---+-------+-------+-------+-------+-------+------+-------+-------+
             1982    1984    1986    1988    1990    1992   1994    1996
                                       Time (year)

Cmd> delete(LASTPLOT,x1r) # no longer needed

Cmd> getmacros(compza,quiet:T)

Cmd> compza(x1,alpha:.1,S:20)
component: za
 (1)      -0.5488      0.47102       1.0048       2.9934       3.4881
 (6)      -5.0421       -1.948       2.4692      -3.2995     -0.37712
(11)        3.087       3.3745      -1.1749      -1.3944       3.9707
(16)      -4.2189      -4.8188      0.82104      0.65077      0.95695
component: n
(1)           10
component: ka
(1)          8.5
component: alpha
(1)          0.1
component: degree
(1)            0

Cmd> alpha <- .1; ka <- sum(costaper(10, alpha)^2); ka
(1)          8.5

Cmd> rft(padto(costaper(10, alpha)*detrend(x1,0),20))/sqrt(ka)
 (1)      -0.5488      0.47102       1.0048       2.9934       3.4881
 (6)      -5.0421       -1.948       2.4692      -3.2995     -0.37712
(11)        3.087       3.3745      -1.1749      -1.3944       3.9707
(16)      -4.2189      -4.8188      0.82104      0.65077      0.95695

Cmd> delete(alpha,ka,x1)

Cmd> #5.4.6 Smoothing periodograms - compfa and spectrum

Cmd> n <- 5;boxcar <- rep(1/(2*n+1), (2*n+1)) # boxcar of length 11

Cmd> triangle <- convolve(boxcar,padto(boxcar,4*n+1)) # length 21

Cmd> bell <- convolve(triangle,padto(triangle,8*n+1)) # length 41

Cmd> plot(run(-2*n,2*n),triangle,impulse:T,ymin:0,xlab:"Index s",\
		ylab:"Weights",\
		title:"Convolution square of Box car of length 11")
                       Convolution square of Box car of length 11
           ++---------------+---------------+---------------+----------------++
           |                                .                                 |
           |                                .                                 |
           |                             .  .  .                              |
       0.08+                             .  .  .                              +
           |                          .  .  .  .   .                          |
           |                          .  .  .  .   .                          |
           |                      .   .  .  .  .   .  .                       |
 W     0.06+                   .  .   .  .  .  .   .  .  .                    +
 e         |                   .  .   .  .  .  .   .  .  .                    |
 i         |                .  .  .   .  .  .  .   .  .  .  .                 |
 g         |                .  .  .   .  .  .  .   .  .  .  .                 |
 h     0.04+             .  .  .  .   .  .  .  .   .  .  .  .   .             +
 t         |             .  .  .  .   .  .  .  .   .  .  .  .   .             |
 s         |         .   .  .  .  .   .  .  .  .   .  .  .  .   .  .          |
           |      .  .   .  .  .  .   .  .  .  .   .  .  .  .   .  .  .       |
       0.02+      .  .   .  .  .  .   .  .  .  .   .  .  .  .   .  .  .       +
           |   .  .  .   .  .  .  .   .  .  .  .   .  .  .  .   .  .  .  .    |
           |   .  .  .   .  .  .  .   .  .  .  .   .  .  .  .   .  .  .  .    |
           |.  .  .  .   .  .  .  .   .  .  .  .   .  .  .  .   .  .  .  .   .|
          0+..................................................................+
           ++---------------+---------------+---------------+----------------++
           -10             -5               0               5               10
                                         Index s

Cmd> plot(run(-4*n,4*n),bell,impulse:T,ymin:0,xlab:"Index s",\
		ylab:"Weights",\
		title:"Convolution 4th power of Box car of length 11")
                      Convolution 4th power of Box car of length 11
           ++-------+-------+-------+-------+-------+-------+-------+--------++
           |                                .                                 |
       0.06+                             .. . ..                              +
           |                           . .. . .. .                            |
           |                           . .. . .. .                            |
       0.05+                          .. .. . .. . .                          +
           |                        . .. .. . .. . ..                         |
           |                        . .. .. . .. . ..                         |
 W     0.04+                      . . .. .. . .. . .. .                       +
 e         |                     .. . .. .. . .. . .. ..                      |
 i         |                     .. . .. .. . .. . .. ..                      |
 g     0.03+                   . .. . .. .. . .. . .. .. .                    +
 h         |                   . .. . .. .. . .. . .. .. .                    |
 t         |                 . . .. . .. .. . .. . .. .. . .                  |
 s     0.02+                .. . .. . .. .. . .. . .. .. . ..                 +
           |                .. . .. . .. .. . .. . .. .. . ..                 |
           |              . .. . .. . .. .. . .. . .. .. . .. .               |
       0.01+             .. .. . .. . .. .. . .. . .. .. . .. . .             +
           |           . .. .. . .. . .. .. . .. . .. .. . .. . ..            |
           |        .. . .. .. . .. . .. .. . .. . .. .. . .. . .. ..         |
          0+..................................................................+
           ++-------+-------+-------+-------+-------+-------+-------+--------++
           -20     -15     -10     -5       0       5      10      15       20
                                         Index s

Cmd> delete(boxcar,triangle,bell,LASTPLOT)

Cmd> getmacros(compfa,quiet:T)

Cmd> sazz <- compfa(z,15,alpha:.1) # note explanatory comment
rep(1/9,9)^*4 smoother with 16.7 edf, S = 400

Cmd> delete(sazz)

Cmd> ffplot(compfa(z,5,alpha:.1,quiet:T),show:F)

Cmd> ffplot(compfa(z,10,alpha:.1,quiet:T),add:T,linetype:2,show:F)

Cmd> ffplot(compfa(z,15,alpha:.1,quiet:T),add:T,linetype:3,\
xlab:"Frequency (cycles per year)",ylab:"Spectrum",\
title:"Smoothed modified periodograms with about 5, 10 and 15 edf")
               Smoothed modified periodograms with about 5, 10 and 15 edf
           ++---------+----------+----------+----------+----------+----------++
         80+:          .                                                      +
           |:         ..                                                      |
         70+:         ..                                                      +
           |:         ..                                                      |
           |:         ..                                 .                    |
         60+:         ..                                 ..  ..               +
           |:         --                    .            .. .-.        .      |
 S       50+:         --                    ..           .. --- . .    ..     +
 p         |:         ==-                   ..           ..==== ....   ..    .|
 e         |:        =. =                   ..           ==-  -==-..   ..  .--|
 c       40+:       .=  ==               .. -.          ==..  .-===.   ..  .-=+
 t         |:      .=.  .=               ..==-         -=...   ...==  ---  -= |
 r       30+:      ==.  .-=        .   .======         =. ..   ..  == ===  =  +
 u         |:      = .    ==.     . . ===... ==       ==       .   -==- ===-  |
 m         |:     =. .     ==     -==== .  .  =      ==        .   .--. .--   |
         20+:  . ==        .==.  == ..        -=    ==.             . .  --   +
           |:  ===           -====.  .         == .==-              .    ..   |
         10+: ==..            ---              -====.                    ..   +
           |===                .               .--                       ..   |
           |=-                 .                .                             |
          0++---------+----------+----------+----------+----------+----------++
            0         1          2          3          4          5          6
                               Frequency (cycles per year)

Cmd> delete(LASTPLOT)

Cmd> getmacros(spectrum,quiet:T)

Cmd> S <- 2*nrows(x) # set number of frequencies

Cmd> sxxhat <- spectrum(x,7)

Cmd> ffplot(sxxhat,ymin:0,xlab:"Frequency (cycles per year)",\
ylab:"Power Spectrum",title:\
"Smoothed Periodogram, N = 200, S = 400, (rep(1/7,7))^*4 smoother")
            Smoothed Periodogram, N = 200, S = 400, (rep(1/7,7))^*4 smoother
           ++---------+----------+----------+----------+----------+----------++
        200+:          .                                                      +
           |:         ...                                                     |
           |:         . .                                                     |
           |:         . .                                                     |
 P         |:        .  .                                                     |
 o      150+:        .   .                                                    +
 w         |:        .   .                                                    |
 e         |:        .   .                                                    |
 r         |:       .    .                                                    |
           |:       .     .                                                   |
 S      100+:       .     .                                                   +
 p         |:      .      .                                                   |
 e         |:      .       .                                                  |
 c         |:     .        ..                                                 |
 t         |:    ..         .                                                 |
 r       50+:  ...           .                                                +
 u         |: ..             .                                                |
 m         |:..               .                                               |
           |..                .. ....                                         |
          0+..................................................................+
           ++---------+----------+----------+----------+----------+----------++
            0         1          2          3          4          5          6
                               Frequency (cycles per year)

Cmd> delete(sxxhat,LASTPLOT)

Cmd> #5.4.7 Smoothing cross-periodograms - compfa and crsspectrum

Cmd> shat <- compfa(hconcat(x,z),10,alpha:.1,cross:T,S:400)
rep(1/6,6)^*4 smoother with 11.1 edf, S = 400

Cmd> list(shat) # columns are sxxhat, szzhat, sxzhat
shat            REAL   400   3    

Cmd> ffplot(shat[,1],ymin:0,\
	lab:"Frequency (cycles)",ylab:"Spectrum",\
	title:"Estimated spectrum of x with 11 edf")
                           Estimated spectrum of x with 11 edf
           ++---------+----------+----------+----------+----------+----------++
           |:          .                                                      |
        200+:         ..                                                      +
           |:         . .                                                     |
           |:         . .                                                     |
           |:        .  .                                                     |
           |:        .  .                                                     |
        150+:        .  .                                                     +
 S         |:       .    .                                                    |
 p         |:       .    .                                                    |
 e         |:       .    .                                                    |
 c      100+:      .     .                                                    +
 t         |:      .      .                                                   |
 r         |:      .      .                                                   |
 u         |:     .       .                                                   |
 m         |:     .        ..                                                 |
         50+:  ...          ..                                                +
           |: .              .                                                |
           |:..              ..                                               |
           |..                ..  ...                                         |
          0+..................................................................+
           ++---------+----------+----------+----------+----------+----------++
            0         1          2          3          4          5          6
                                   Frequency (Cycles)

Cmd> ffplot(shat[,2],ymin:0,\
	xlab:"Frequency (cycles)",ylab:"Spectrum",\
	title:"Estimated spectrum of z with 11 edf")
                           Estimated spectrum of z with 11 edf
           ++---------+----------+----------+----------+----------+----------++
           |:          .                                                      |
           |:         ..                                     .                |
         50+:         ..                                    ...               +
           |:         . .                                   . .               |
           |:        .  .                                ...  .               |
           |:        .  .                                .     . .          ..|
         40+:        .  .                               .      ....         . +
 S         |:        .   .                  ..          .         .    .    . |
 p         |:       .    .                 . .         .           .  . .  .  |
 e       30+:       .    .              .... .         .           .  . .  .  +
 c         |:      .      .            ..     .        .           .  . .  .  |
 t         |:      .       ..      .. .       .       .             ..   ..   |
 r         |:     .         .     . ...       .       .             ..   ..   |
 u       20+:     .          .   ..           .      .                   ..   +
 m         |:    .           ..  .             .    ..                        |
           |:  ...            . ..             .  ...                         |
         10+: .                ..              ....                           +
           |:.                                  ..                            |
           |..                                                                |
          0+..................................................................+
           ++---------+----------+----------+----------+----------+----------++
            0         1          2          3          4          5          6
                                   Frequency (cycles)

Cmd> sxzhat <- shat[,3] # Hermitian form of cross spectrum

Cmd> coherhat <- hreal(hpolar(sxzhat))/sqrt(shat[,1]*shat[,2])

Cmd> delete(shat)

Cmd> phasexz <- himag(hpolar(sxzhat)) # arg(sxzhat)

Cmd> #See Sec. 5.2.4 for hreal(), himag(), and hpolar()

Cmd> ffplot(hconcat(coher,coherhat),ymin:0,ymax:1,\
xlab:"Frequency (cycles per year)",ylab:"Coherence",\
title:"Coherence and estimated coherence between x and z, edf = 11")
               Coherence and estimated coherence between x and z, edf = 11
           ++---------+----------+----------+----------+----------+----------++
          1+:                                                                 +
           |:---   -------                                                    |
           |--..----..  ..---                                                 |
           |-             ..--                                                |
        0.8+:              ..-                                                +
           |:               .--  ---                                          |
 C         |:                .- -- -                             ---          |
 o         |:                .- -   -                           -- -          |
 h      0.6+:                 .--   - --     --   --            -   -         +
 e         |:                  -     ---     --   - -           -   -         |
 r         |:                   .      -  -  --   - -           -   -         |
 e         |:                   ..      - ---  -  - -          -     -        |
 n      0.4+:                    ..     -- --  - -  -    --  ---     -  -  -- +
 c         |:                      ..   -- --  - -   -   - -- --     - --- -- |
 e         |:                       ..  -- --  - -   ----  --        - - - -- |
           |:                         ..-- --   --    --             --  -- - |
        0.2+:                           ...--   --                    -  --  -+
           |:                              .-...--                    -   -  -|
           |:                               -   --................            |
          0+:...................................-.............................+
           ++---------+----------+----------+----------+----------+----------++
            0         1          2          3          4          5          6
                               Frequency (cycles per year)

Cmd> ffplot(phasexz,xlab:"Frequency (cycles per year)",\
ylab:"Phase in Cycles",\
title:"Estimated phase = arg(sxzhat) between x and z, edf = 11;arg(sxz) = 0")
          Estimated phase = arg(sxzhat) between x and z, edf = 11;arg(sxz) = 0
           ++---------+----------+----------+----------+----------+----------++
           |:                               .                                 |
           |:                               .....                             |
        0.6+:                               .   .                             +
 P         |:                               .   .                             |
 h         |:                               .   .                             |
 a         |:                               .   .                             |
 s      0.4+:                              .    .                             +
 e         |:                              .    .                             |
           |:                            ...    .          ...             ...|
 i      0.2+:                            .       .        ..  .           ..  +
 n         |:                            .       .   ..  .    .           .   |
           |:                           .        ...... ..     .          .   |
 C         |..                          .          ..  ..      .          .   |
 y        0+..................................................................+
 c         |:                   ...    .                        .      ...    |
 l         |:                     ..  .                         ..    .       |
 e         |:                       ..                            ..  .       |
 s     -0.2+:                                                      .. .       +
           |:                                                       . .       |
           |:                                                       ..        |
       -0.4++---------+----------+----------+----------+----------+----------++
            0         1          2          3          4          5          6
                               Frequency (cycles per year)

Cmd> delete(coher,coherhat,phasexz,sxzhat,LASTPLOT) # no longer needed

Cmd> getmacros(crsspectrum,quiet:T)

Cmd> S <- 400; shat1 <- crsspectrum(costaper(200,.1)*hconcat(x,z),6)

Cmd> # This does same tapering, smoothing as was done by compfa

Cmd> list(shat1) # columns are sxxhat, szzhat, sxzhat as for compfa
shat1           REAL   400   3    

Cmd> delete(shat1)

Cmd> #5.4.8 Multi-taper spectrum estimation - multitaper

Cmd> getmacros(dpss,multitaper,quiet:T)

Cmd> ffplot(hconcat(sxx,multitaper(x,.05/DELTAT,5)),\
xlab:"Cycles per year",ylab:"Spectrum",\
title:"Spectrum and multi-taper spectrum estimate, W=.6 cycles per 
year, K = 5")
      Spectrum and multi-taper spectrum estimate, W=.6 cycles per 
year, K = 5
           ++---------+----------+----------+----------+----------+----------++
           |:         -                                                       |
           |:         --.                                                     |
           |:         --.                                                     |
           |:       - --.                                                     |
        150+:       --.--.                                                    +
           |:       - . -.                                                    |
           |:      - .  --                                                    |
 S         |:      - .    -                                                   |
 p         |:      -..    -                                                   |
 e      100+:      -.     -                                                   +
 c         |:     --.     -                                                   |
 t         |:    --.       --                                                 |
 r         |:    -..       .-                                                 |
 u         |:    -.        .-                                                 |
 m       50+:  ..-          -                                                 +
           |.... -          .-                                                |
           |: ---            -                                                |
           |---              ---                                              |
           |--                 -.-                                            |
           |-                   ----------------------------------------------|
          0++---------+----------+----------+----------+----------+----------++
            0         1          2          3          4          5          6
                                     Cycles per year

Cmd> delete(LASTPLOT)

Cmd> #5.4.9 Autoregressive spectrum estimation - arspectrum and burg

Cmd> getmacros(arspectrum,quiet:T)

Cmd> arspect <- arspectrum(x,2,400) # use 400 frequencies

Cmd> compnames(arspect) # arspect has 3 components
(1) "phi"
(2) "var"
(3) "spectrum"

Cmd> arspect[run(2)] # first two components
component: phi
(1)       1.3658     -0.69382
component: var
(1)       4.7358

Cmd> sxx2 <- arspect$spectrum

Cmd> delete(arspect)

Cmd> sxx10 <- arspectrum(x,10,400)$spectrum # now fit AR(10)

Cmd> ffplot(hconcat(sxx,sxx2,sxx10),\
xlab:"Frequency (Cycles per year)",ylab:"Spectrum",\
title:"AR(2) spectrum (solid) with and AR(2) and AR(10) estimates 
(dashed)")
          AR(2) spectrum (solid) with and AR(2) and AR(10) estimates 
(dashed)
           ++---------+----------+----------+----------+----------+----------++
           |:          =                                                      |
           |:         ==                                                      |
        200+:         = =                                                     +
           |:         = =                                                     |
           |:        = .=                                                     |
           |:        =..=                                                     |
        150+:        =.--=                                                    +
 S         |:        =-- =                                                    |
 p         |:        =-  =                                                    |
 e         |:       =--  =-                                                   |
 c         |:       =-    =                                                   |
 t      100+:       =     =-                                                  +
 r         |:      =-     =-                                                  |
 u         |:     -=       =-                                                 |
 m         |:    -==       =-                                                 |
         50+: ---==         =                                                 +
           |--- ==          ==                                                |
           |: ===            ==-                                              |
           |==                ====-                                           |
           |:                    =============================================|
          0++---------+----------+----------+----------+----------+----------++
            0         1          2          3          4          5          6
                               Frequency (Cycles per year)

Cmd> delete(sxx2,sxx10)

Cmd> getmacros(burg,quiet:T)

Cmd> burgspect<-burg(x,2,S:400) # use 400 frequencies

Cmd> burgspect[run(2)] # first two components
component: var
(1)       3.9964
component: phi
(1)       1.4143     -0.74251

Cmd> sxx2 <- burgspect$spectrum

Cmd> sxx10 <- burg(x,10,S:400)$spectrum # now use p = 10

Cmd> ffplot(hconcat(sxx,sxx2,sxx10),\
xlab:"Frequency (Cycles per year)",ylab:"Spectrum",\
title:"AR(2) spectrum (solid) with Burg AR(2) and AR(10) estimates (dashed)")
          AR(2) spectrum (solid) with Burg AR(2) and AR(10) estimates (dashed)
           ++---------+----------+----------+----------+----------+----------++
        200+:          =                                                      +
           |:          ==                                                     |
           |:         =-=                                                     |
           |:         =-.=                                                    |
           |:        =.- =                                                    |
        150+:        =-  =                                                    +
           |:        =-  .=                                                   |
 S         |:        =-  .=                                                   |
 p         |:       =-    =                                                   |
 e         |:       =-    =                                                   |
 c      100+:       =     .=                                                  +
 t         |:      =-      =                                                  |
 r         |:     .=       =                                                  |
 u         |:    .=-       =-                                                 |
 m         |:   .-=         =                                                 |
         50+...--=          =-                                                +
           |--- =           ==                                                |
           |====             ==-                                              |
           |=                 ====                                            |
           |:                    =============================================|
          0++---------+----------+----------+----------+----------+----------++
            0         1          2          3          4          5          6
                               Frequency (Cycles per year)

Cmd> asciisave("chkpnt5.sav") # make sure all variables created are savable
Workspace asciisaved on file chkpnt5.sav

Cmd> restore("chkpnt5.sav")
Restoring workspace from file chkpnt5.sav
Workspace saved Thu Mar 25 13:40:31 1999

Cmd> print(paste("Total time =",gettime(quiet:T,keep:T) - startTime))
Total time = 4.94

Cmd> 
Normal termination by end of file on input
